app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "apple"], ["LIMIT", 1]]
---
  def create
    this_user = User.find_by!(username: user_params[:username])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    if session[:user_id]
      user = User.find(session[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    user = User.find(session[:user_id])