app/controllers/sessions_controller.rb

  def create
    user = User.find_by!(username: user_params[:username])
    if user&.authenticate(user_params[:password])
      session[:user_id] = user.id
      user.update_columns(
      spotify_token: '',
      spotify_refresh_token: '',
      spotify_token_lifetime: '',
      spotify_display_name: '',
      spotify_email: '',
      spotify_id: '',
      spotify_img: '',
      spotify_region: '',
      )
---
UPDATE "users" SET "spotify_token" = $1, "spotify_refresh_token" = $2, "spotify_token_lifetime" = $3, "spotify_display_name" = $4, "spotify_email" = $5, "spotify_id" = $6, "spotify_img" = $7, "spotify_region" = $8 WHERE "users"."id" = $9