app/controllers/songs_controller.rb

SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "albums" ("name", "release_date", "total_tracks", "image_url", "spotify_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", nil], ["release_date", nil], ["total_tracks", nil], ["image_url", nil], ["spotify_id", 3], ["created_at", "2023-05-25 22:33:58.391676"], ["updated_at", "2023-05-25 22:33:58.391676"]]
UPDATE "albums" SET "name" = $1, "release_date" = $2, "total_tracks" = $3, "image_url" = $4, "updated_at" = $5 WHERE "albums"."id" = $6
---
def create
  playlist = Playlist.find(song_params[:playlist_id])
  artist = Artist.create!(spotify_id: song_params[:spotify_artist_id])
  artist.update_artist
  album = Album.create!(
    spotify_id: song_params[:spotify_album_id],
    artist_id: artist.id
  )
  album.update_album