app/controllers/spotify_api_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "spotify_token" = $1, "spotify_refresh_token" = $2, "spotify_token_lifetime" = $3, "spotify_display_name" = $4, "spotify_email" = $5, "spotify_id" = $6, "spotify_img" = $7, "spotify_region" = $8 WHERE "users"."id" = $9
---
  def callback
    spotify_user = RSpotify::User.new(request.env['omniauth.auth'])
    current_user = User.find(session[:user_id])
    current_user.update_columns(
      spotify_token: spotify_user.credentials.token,
      spotify_refresh_token: spotify_user.credentials.refresh_token,
      spotify_token_lifetime: spotify_user.credentials.expires_at,
      spotify_display_name: spotify_user.display_name,
      spotify_email: spotify_user.email,
      spotify_id: spotify_user.id,
      spotify_img: spotify_user.images.length > 0 ? spotify_user.images[0].url : '',
      spotify_region: spotify_user.country,
    )