app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("email", "username", "password_digest", "birthdate", "region", "avatar_url", "spotify_token", "spotify_refresh_token", "spotify_display_name", "spotify_email", "spotify_id", "spotify_img", "spotify_token_lifetime", "spotify_region", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"